{
    "title": "What's new in Sitefinity 5.2 Webinar QA Log",
    "needsFixing": false,
    "content": "**These are the unedited comments from the webinar about what\u0027s new in Sitefinity 5.2 by Gabe Sumner.  \n  \n****Audience Question**Q: Any chances to expect soon an addition to thunder for DynamicModules specifically for the section where you want to add a custom field based on a user control you created. A bit like the wizard for the designer for existing widget where you can select the property you want to add and it would generate the field, the Element and Element definitions with the associated Javascript parts?  \nA: We have something similiar in plans for next year. In 5.3, module builder will support multilingual types.  \n  \n**Audience Question**  \nQ: are there personalization options to track/show/shape if someone came in thru an advertisement ?  \nA: Yes, you can personalize content based on the referral url.  \n  \n**Audience Question**  \nQ: Is personalization cookie based? (and thus subject to EU cookie law?)  \nA: Yes and yes.  \n  \n**Audience Question**  \nQ: Can we personalize based on the existance of facial hair?  \nA: Not yet :)  \n  \n**Audience Question**  \nQ: Wil Thunder be updated to support default fields for the widgets? For instance image selecter, page selector and tabs (like in the news widget) so these fields can be added easily instead of by hand  \nA: Yes, it\u0027s on the roadmap.  \n  \n**Audience Question**  \nQ: how about when I have exactly the same content but want to initiate with different templates on entry  \nA: This is not supported at the moment.  \n  \n**Audience Question**  \nQ: Pity that these features are not available in standard version :(  \nA: You can address your concerns with sales: sales@sitefinity.com  \n  \n**Audience Question**  \nQ: What about widget personalization (int he future)?...so i dont want to maintain 2 pages, just have a widget showup for a certain user type?  \nA: Not supported by design - it gets too complicated to understand what\u0027s really happening (think 10 segments, some have widgets, some don\u0027t - ordering of widgets etc..). We will have personalization API exposed pretty soon, though, so you can implement it if you want to.  \n  \n**Audience Question**  \nQ: have you published somewhere what is the roadmap for 5.3 ?   \nA: Next week. In short: performance improvements, bug fixes, polish etc. No new features.  \n  \n**Audience Question**  \nQ: Could the admin users be shared across the sites but then each site has its own CMS authors?  \nA: Yes.  \n  \n**Audience Question**  \nQ: does personalization work with multi-lingual differences?  \nA: Yes.  \n  \n**Audience Question**  \nQ: Are multiwebsites only activated in hosted environments? I can\u0027t find the options on a localhost project.  \nA: No, they work locally also. Make sure you have a proper license and that Multisite module is turned on. Administration \u003e Modules  \n  \n**Audience Question**  \nQ: Do you plan some Sharepoint integration?  \nA: Not for 5.3, next year - yes.  \n  \n**Audience Question**  \nQ: are you going to publish the list of the bugs that are going to be fixed ?  are you going to make changes in the API and  make it more developer friendly ?   \nA: yes. that\u0027s a broad question - not sure really how to answer.  \n  \n**Audience Question**  \nQ: How does personalization work with search ?  Content will be seperately indexed, or just non-personalized?  \nA: just non-personalized  \n  \n**Audience Question**  \nQ: will this \u0027configure modules for sitefinity\u0027 also show custom modules?  \nA: yes, it does show custom modules.  \n  \n**Audience Question**  \nQ: I\u0027m using a professional (partner) license but when trying to install the Multisite module I get the error that I need to purchase a higher license.  \nA: Please contact sales@sitefinity.com regarding the licensing issues.  \n  \n**Audience Question**  \nQ: I\u0027m assuming all this shown functionality will also support multilang, can you pls confirm?  \nA: yes, multilingual is supported both in multisite and personalization. You can define different languages per site.  \n  \n**Audience Question**  \nQ: I just want to know if you have any comparison about the Dot Net Nuke versus Sitefinity.  I appreciate any input or link.  Thanks.    \nA: We do not comment on other CMS systems.  \n  \n**Audience Question**  \nQ: I just want to know if you have any comparison about the Dot Net Nuke versus Sitefinity.  I appreciate any input or link.  Thanks.    \nA: Yes, not possible because of performance implications. If you are sorting, for example, you\u0027d need to pull both datasources in memory. One data source could be in XML, while other could be in SQL Server. You are always free to implement bridge or adapter.  \n  \n**Audience Question**  \nQ: Not possible to pull from two sources I guess. Like image galleries can not pull from two libraries, right  \nA: Yes, not possible because of performance implications. If you are sorting, for example, you\u0027d need to pull both data sources in memory. One data source could be in XML, while other could be in SQL Server. You are always free to implement bridge or adapter.  \n  \n**Audience Question**  \nQ: I just want to know if you have any comparison about the Dot Net Nuke versus Sitefinity.  I appreciate any input or link.  Thanks.    \nA: We do not comment on other CMS systems.  \n  \n**Audience Question**  \nQ: Thanks  \nA: No problem.  \n  \n**Audience Question**  \nQ: does multi-site / datasource function from several seperate db\u0027s or from 1 single?  \nA: depends on the provider implementation. It can work both ways.  \n  \n**Audience Question**  \nQ: Are taxonomies used by name or by Id, because two taxons with same names will have different IDs in two different sites  \nA: by id; they will require unique url name however, so that you can have /news/sports for example  \n  \n**Audience Question**  \nQ: With shared templates. If one user from one site changes the template shared to his site, will that affect the template on site number two?  \nA: Yes. You can disable that however, but not making them shared.  \n  \n**Audience Question**  \nQ: i have tried Sitefinity Lightning, but how can i put current styles to Lightning on desktop, that the news seems same as on website ?  \nA: This is not implemented yet, however, it is planned. This is a CTP release that\u0027s been developed for less than 45 days. Lightning will be released on the similar schedule as Thunder. Very short, rapid iterations.  \n  \n**Audience Question**  \nQ: is it still 1 database regardless of the number of sites? or is it 1 db per site?  \nA: By default, it\u0027s 1. You can configure it easily to be multiple though.  \n  \n**Audience Question**  \nQ: Q: I just want to know if you have any comparison about the Dot Net Nuke versus Sitefinity.  I appreciate any input or link.  Thanks.    \nA: We do not comment on other CMS systems.  \n\\- Except that it sucks, AM I RIGHT!  \\*HIGHFIVE\\*  \nA: Still not commenting on other CMS systems. :)  \n  \n**Audience Question**  \nQ: will 5.3 support .NET 4.5 now that Lightning is build on .NET 4.5 ?  \nA: We are still deliberating on that. We\u0027ll keep you posted.  \n  \n**Audience Question**  \nQ: Will a recording of this presentation and/or a copy of the Q\u0026A be available after the presentation?  \nA: Yes, once it\u0027s processed - probably in 24 hours. https://www.sitefinity.com/devnet/webinars/webinars-on-demand  \n  \n**Audience Question**  \nQ: are classifications shared across sites? or each site has its own set?  \nA: shared accross sites.  \n  \n**Audience Question**  \nQ: Can I share custom widgets from the toolbox among sites?  \nA: Yes, that\u0027s the default behavior.  \n  \n**Audience Question**  \nQ: With multiple sites in one instance...Do they share the same application pool?  \nA: Yes.  \n  \n**Audience Question**  \nQ: great information about lightning .... thumbs up  \nA: Thanks.  \n  \n**Audience Question**  \nQ: Will use of Lightning count as a backend CMS user for licensing purposes?  \nA: Yes. :)  \n  \n**Audience Question**  \nQ: will personalization be possible to not personalize \u0027person\u0027 but \u0027experience\u0027 ? so xbox, mobile and desktop get personalized experience or is that not in the pipeline?  \nA: That\u0027s what responsive design is for. In short, no - in long, yes. You can implement custom personalization evaluators.  \n  \n**Audience Question**  \nQ: Can I share custom widgets from the toolbox among sites?  \nA: Yes, that\u0027s how it works by default.  \n  \n**Audience Question**  \nQ: Do we need the server component to use lightening desktop?  \nA: Yes. https://www.sitefinity.com/lightningclient/server/SitefinityLightningServer.zip  \n  \n**Audience Question**  \nQ: Is Personalization an add-on possibility for Standard and has the price been defined?  \nA: Please contact sales@sitefinity.com for licensing information.  \n  \n**Audience Question**  \nQ: Thanks  \nA: No problem.  \n  \n**Audience Question**  \nQ: from a developer\u0027s perspective, are you guys updating the sitefinity API to provide us with an easy way to access content from different sites? i.e. with the current fluent api I don\u0027t have to worry which site I\u0027m   \nA: There is a class called MultiSiteContext, which handles this. You are always in the \"current\" site, so it works automatically. You have the option to specify a \"non-current\" site though.  \n  \n**Audience Question**  \nQ: from a developer\u0027s perspective, are you guys updating the sitefinity API to provide us with an easy way to access content from different sites? i.e. with the current fluent api I don\u0027t have to worry which site I\u0027m acessing, how will this work with multi-site?  \nA: There is a class called MultiSiteContext, which handles this. You are always in the \"current\" site, so it works automatically. You have the option to specify a \"non-current\" site though.  \n  \n**Audience Question**  \nQ: I might have missed this due to someone making me take my headset off :p  ...but will Lightning auto-update itself (the client)?  \nA: It is autoupadating itself already.  \n  \n**Audience Question**  \nQ: can personalization be used for a/b testing?  \nA: Not at the moment. High on the priority list.  \n  \n**Audience Question**  \nQ: Can the sites be on different servers and use different databases and still be managed from one \"Main site\"?  \nA: Not at the moment. Planned in the mid-term, but not that soon.  \n  \n**Audience Question**  \nQ: Oh, one question about automatic redirection prior user language in browser. I implement a website in multiple languages, but automatic redirection to appropiate language dont work :(  \nA: Check your browser settings. This is where default language is being taken from.  \n  \n**Audience Question**  \nQ: is this webinar being recorded?  \nA: Yes, will be published after processing here: https://www.sitefinity.com/devnet/webinars/webinars-on-demand  \n  \n**Audience Question**  \nQ: **Audience Question**  \nQ: can personalization be used for a/b testing?  \nA: Not at the moment. High on the priority list.  \ndoes that means that we are going to get it for 5.3 ?   \nA: No. No new features for 5.3.  \n  \n**Audience Question**  \nQ: Can the Sitefinity backend access be set to use SSL on all sites?  \nA: Yes.  \n  \n**Audience Question**  \nQ: how does personalization handle multiple applicable rules? say ip address and landingurl both count, is there a priority ?  \nA: yes, there is a priority. First match is always taken.  \n  \n**Audience Question**  \nQ: multisite with backend pages: can each site have its own custom menu options / backend pages?  \nA: In all honesty not sure. It should be possible, but the scenario wasn\u0027t tested.  \n  \n**Audience Question**  \nQ: I need all old webinars  \nA: https://www.sitefinity.com/devnet/webinars/webinars-on-demand  \n  \n**Audience Question**  \nQ: should this work, when the languages on website are in folders ? https://somesite/en  \nA: \"this\" being? :)  \n  \n**Audience Question**  \nQ: So, do the different sites need to be on the same database, or just the same server? What if I have all the sitefinity DB\u0027s on a single server, but the actual websites are on different servers. Does that work?  \nA: one server always. one or multiple databases - your choice.  \n  \n**Audience Question**  \nQ: How do I set only the Backend to use SSL? What happens when editing pages, whose URLs do not start with ~/Sitefinity  \nA: Please use our support for technical questions.  \n  \n**Audience Question**  \nQ: can you retag pits issue #13002  from feature request to bug issue ?  \nA: It\u0027s a feature request.  \n  \n**Audience Question**  \nQ: Any plans for other storm-based tools?  Sitefinity Monsoon perhaps?  \nA: No :)  \n  \n**Audience Question**  \nQ: not related to this presentation: dbsync with custom modules, any plans on making that possible? :D   \nA: Yes, planned - soon, quite soon.  \n  \n**Audience Question**  \nQ: Per Sitefinity raodmap \"Multisite management will have a different and flexible licensing model tailored to a multi-tenant instance for managing multiple sites.\" Is Gabe going to cover the new flexible licensing model?  \nA: No, please contact sales@sitefinity.com for licensing questions.  \n  \n**Audience Question**  \nQ: How are changes on personalized pages synced?  Like if 2 pages are 95% the same, changes would need to be made on both, or shared content blocks used?  \nA: They are not synced. Use templates if you want to have one place to make changes to all personalized versions.  \n  \n**Audience Question**  \nQ: That\u0027s too bad. I have 6 sites I need to manage and I can\u0027t put them all on one server. Performance would suffer.  \nA: Depends on a server and a lot of other things.  \n  \n**Audience Question**  \nQ: Q: What if I have all the sitefinity DB\u0027s on a single server, but the actual websites are on different servers. Does that work?  \nA: one server always. one or multiple databases - your choice  \nPresumably we can load-balance across multiple servers?  \nA: Absolutely, you can load balance.  \n  \n**Audience Question**  \nQ: Can we clone one site using another as a starting point, then modify the new site without affecting the original cloned site?...so that they are essentially completely separate content, templates, etc.  \nA: Not at the moment, but we are looking into it.  \n  \n**Audience Question**  \nQ: ok i have to ask you this :   \nA: please do.  \n  \n**Audience Question**  \nQ: can you put the sdk download link back onto the account/download  other resources page?  \nA: I\u0027ll relay it to our UX team.  \n  \n**Audience Question**  \nQ: Once a client is tagged with a taxonomy, is that taxonomy persisted across multiple sessions with client cookies?  \nA: You can\u0027t tag a client with taxonomy, but I guess you are taking user segments. Answer is yes. There is also reconciliation between anonymous and registered users once user logs in.  \n  \n**Audience Question**  \nQ: multisite: are images librariles / document libs also per site? or shared? or maybe either (configurable)? :D  \nA: both. You can have some shared and some only for particular site.  \n  \n**Audience Question**  \nQ: ok i have to ask you this  :  you are saying that some features are planned really soon or soon but actually that means that you are going to do them after half an year for  next next major release since you are going to have one bug fixing release   \nA: We do not discuss roadmap for more than 1 release ahead. There is also a difference between a new feature and an improvement. What I can say is that we will focus very hard on problems of our existing customers and give our best to solve any problems they may have.  \n  \n**Audience Question**  \nQ: any Facebook integration capabilities? is it posible to use for personalization?  \nA: Not yet... perhaps an SDK sample as a custom personalization evaluator.  \n  \n**Audience Question**  \nQ: Will new multisite management flexible licensing model/costs be published on Sitefinity.com soon?  \nA: Please contact sales@sitefinity.com for all licensing related questions.  \n  \n**Audience Question**  \nQ: you\u0027re right - we do love that!  \nA: glad you like that :)  \n  \n**Audience Question**  \nQ: Is there a way to tell what the differences are or at least what area they are in when using personalization?  \nA: Not sure what the question is about.  \n  \n**Audience Question**  \nQ: are you planing to enable the second level chache for Open Access  in load balancing mode ?   \nA: We may.  \n  \n**Audience Question**  \nQ: I know you can\u0027t but if you gave some price estimates on that stuff you had a lot less questions  \nA: Please contact sales@sitefinity.com for all licensing questions. (I have a multistore clipboard :))  \n  \n**Audience Question**  \nQ: multisites: are images librariles / document libs also per site? or shared? or maybe either (configurable)? :D  \nA: both, configurable  \n  \n**Audience Question**  \nQ: I will ask a different way - if a person comes to the site and they are determined to be a \"developer\" - if they close the browser and come back, will Sitefinity still know they are a developer if they just come to the home page?    \nA: yes.  \n  \n**Audience Question**  \nQ: **Audience Question**  \nQ: can you put the sdk download link back onto the account/download  other resources page?  \n\\--- got a direct link? cause i can\u0027t find the 5.2 sdk  \nA: https://www.sitefinity.com/resources/tools/software-development-kit  \n  \n**Audience Question**  \nQ: are you planing to enable the second level chache for Open Access  in load balancing mode ?   \nA: We may. No concrete dates that I can share at this moment.  \n  \n**Audience Question**  \nQ: can you point to any case studies where people have migrated from existing sites rather than start from scratch?  \nA: Many. Contact sales@sitefinity.com - they have hundreds of examples that they can share.  \n  \n**Audience Question**  \nQ: module builder: is multi-lang going to be supported on the next release?  \nA: yes, 5.3  \n  \n**Audience Question**  \nQ: Congratulation - This all looks as usaual sensational and very very userfriendly to use. What we expect from you guys. Super  \nA: Thank you Markus. We appreciate it.  \n  \n**Audience Question**  \nQ: Curious. Is there a measureable performance improvement of using the multi-site feature, each w/separate db\u0027s...versus separate Sitefinity instances, separate db\u0027s, separate app pools?    \nA: Yes. You load all unmanaged memory only once (major part of Sitefinity memory consumption).  \n  \n**Audience Question**  \nQ: so 5.3 will focus on stability and not bring any new features? if so, this would be great news.  \nA: Yes, that is so.  \n  \n**Audience Question**  \nQ: Should be noted that not mentioning anything about multi-site licensing and having people go right to sales very much seems like a pricing model base on how much money you have...yes?  \nA: We\u0027ll try to get some sales people in next time. I really have no idea how much it costs.  \n  \n**Audience Question**  \nQ: please address how we can use personalization to change the default template  \nA: It\u0027s a very tricky thing as your widgets may get lost unless the two templates have 100% identical layout structure. It may cause a lot of bugs, but we\u0027ll look into it.  \n  \n**Audience Question**  \nQ: When a search engine crawls a website, when personalized versions of a page exists, which page can be expected to be served?  Will it always be the default, or might it depend on which link the crawler came from?  \nA: Always default. Crawlers do not have personality ;)  \n  \n**Audience Question**  \nQ: COMMON, show dropbox please, someone go whack gabe  \nA: It\u0027s cool. We\u0027ll make a video and post a blog about it.  \n  \n**Audience Question**  \nQ: How does personalization affect SEO. What version would crawlers see?   \nA: Default one.  \n  \n**Audience Question**  \nQ: any plans for an amazon s3 provider for images and documents?  \nA: No immediate plans.  \n  \n**Audience Question**  \nQ: FYI, you might wanna change the multi-currency image. France has euro\u0027s. GBP is the currency of the United Kingdom  \nA: Thank you. If only we have presence in Europe :D  \n  \n**Audience Question**  \nQ: Nope, no gabe, no it, show dropbox, common...bad gabe  \nA: Thank you for your input Steve.  \n  \n**Audience Question**  \nQ: Are you using your personalization engine for www.sitefinity.com as well?  \nA: No.  \n  \n**Audience Question**  \nQ: Great question board moderation.  Thanks!!!  \nA: Thank you sir.  \n  \n**Audience Question**  \nQ: Gabe, good job on ur presentation, u rock!  \nA: Thanks on behalf of Gabe.  \n  \n**Audience Question**  \nQ: the 5.2 SDK can be downloaded from the trial installer  \nA: Yes and https://www.sitefinity.com/resources/tools/software-development-kit  \n  \n**Audience Question**  \nQ: Is the new installer ready?  I\u0027ve tried using the Telerik Control Panel, but did not see an option for Sitefinity installation.  Do I need to install the Evaluation Edition of Sitefinity?  \nA: It\u0027s ready: https://www.sitefinity.com/try-now  \n  \n**Audience Question**  \nQ: If you make a personalization to a page for a deveoper and make a subtle change. A few words here or there or customization of banner adds. Is there a way to highlight what is different between the everyone page and the personized page? Maybe not in gross detail, but at least there is some change in this area, but this area is not changed.  \nA: We haven\u0027t thought of this, but it\u0027s an interesting idea. We\u0027ll look into it.  \n  \n**Audience Question**  \nQ: **Audience Question**  \nQ: are you planing to enable the second level chache for Open Access  in load balancing mode ?   \nA: We may. No concrete dates that I can share at this moment.  \nthe reason for the question is that we noticed a big difference in the performance   \nA: Yes, but I cannot go in long details of why and why not here, as it\u0027s a much longer conversation. I am happy to chat over email or phone.  \n  \n**Audience Question**  \nQ: Great presentation!  Very dynamic and interesting.  Kudos to presenter.  \nA: Thank you on behalf of Gabe.  \n  \n**Audience Question**  \nQ: What version did Banner content come in?  \nA: It\u0027s module builder. It\u0027s not a built-in module. :)  \n  \n**Audience Question**  \nQ: Good showing congrats!  \nA: Thank you  \n  \n**Audience Question**  \nQ: Will 5.2 work on Azure   \nA: It alredy works: https://www.linotadros.com/  \n  \n**Audience Question**  \nQ: Any plans for images/documents making it truely multilingual (different document EN/DE/FR for example)  \nA: no immediate plans, but yes, we do keep this in mind.  \n  \n**Audience Question**  \nQ: Awesome news...Thank you.   \nA: Thank you.  \n  \n**Audience Question**  \nQ: #AwkwardSilence  \nA: #...  \n  \n**Audience Question**  \nQ: when is 5.3 due to be released?  \nA: December 2012  \n  \n**Audience Question**  \nQ: soory 5.3  \nA: ok  \n  \n**Audience Question**  \nQ: With the multisite is their support for selecting multiple sources for the news content?  \nA: Yes.  \n  \n**Audience Question**  \nQ: is it work with windows azure?  \nA: yes",
    "featuredImage": "/images/stock/500x280/img22.jpg",
    "seoDescription": "What's new in Sitefinity 5.2 Webinar QA Log. This is the unedited QA session log for the 5.1 webinar session by @gabesumner",
    "seoMetaImage": "/images/stock/500x280/img22.jpg",
    "publishedAt": "2012-10-25T16:00:16.5570000Z",
    "slug": "what's-new-in-sitefinity-52-webinar-qa-log",
    "legacyUrl": "/code/2012/10/25/what's-new-in-sitefinity-52-webinar-qa-log",
    "markdown": true,
    "tags": [
        "News"
    ]
}